# Basic Exercises on Data Importing - Understanding - Manipulating - Analysis - Visualization

## Section-1: The pupose of the below exercises (1-7) is to create dictionary and convert into dataframes, how to diplay etc...
## The below exercises required to create data

### 1. Import the necessary libraries (pandas, numpy, datetime, re etc)

In [59]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import datetime as dt
import seaborn as sns
import re

# set the graphs to show in the jupyter notebook
%matplotlib inline

# set seabor graphs to a better style
sns.set(style="ticks")

### 2. Run the below line of code to create a dictionary and this will be used for below exercises

In [60]:
raw_data = {"name": ['Bulbasaur', 'Charmander','Squirtle','Caterpie'],
            "evolution": ['Ivysaur','Charmeleon','Wartortle','Metapod'],
            "type": ['grass', 'fire', 'water', 'bug'],
            "hp": [45, 39, 44, 45],
            "pokedex": ['yes', 'no','yes','no']                        
            }

In [3]:
### 3. Assign it to a object called pokemon and it should be a pandas DataFrame

In [61]:
pokemon = pd.DataFrame.from_dict(raw_data)

### 4. If the DataFrame columns are in alphabetical order, change the order of the columns as name, type, hp, evolution, pokedex

In [6]:
pokemon = pokemon.reindex(columns=['name', 'type', 'hp', 'evolution','pokedex'])

### 5. Add another column called place, and insert places (lakes, parks, hills, forest etc) of your choice.

In [7]:
pokemon['Place']=['Lakes','parks','hills','forests']

### 6. Display the data type of each column

In [8]:
print(pokemon.dtypes)

name         object
type         object
hp            int64
evolution    object
pokedex      object
Place        object
dtype: object

### 7. Display the info of dataframe

In [9]:
pokemon.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4 entries, 0 to 3
Data columns (total 6 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   name       4 non-null      object
 1   type       4 non-null      object
 2   hp         4 non-null      int64
 3   evolution  4 non-null      object
 4   pokedex    4 non-null      object
 5   Place      4 non-null      object
dtypes: int64(1), object(5)
memory usage: 324.0+ bytes

## Section-2: The pupose of the below exercise (8-20) is to understand deleting data with pandas.
## The below exercises required to use wine.data

### 8. Import the dataset *wine.txt* from the folder and assign it to a object called wine

Please note that the original data text file doesn't contain any header. Please ensure that when you import the data, you should use a suitable argument so as to avoid data getting imported as header.

In [10]:
import os
os.chdir('C:\\Users\\gauta\\OneDrive\\Desktop\\Basic Data Manipulation - Visualization Exercise (5)\\2. Basic Data Manipulation - Visualization Exercise\\Exercise Data Files')
wine=pd.read_csv('wine.txt',header=None)
wine.head(5)

,0,1,2,3,4,5,6,7,8,9,10,11,12,13
0,1,14.23,1.71,2.43,15.6,127,2.80,3.06,0.28,2.29,5.64,1.04,3.92,1065
1,1,13.20,1.78,2.14,11.2,100,2.65,2.76,0.26,1.28,4.38,1.05,3.40,1050
2,1,13.16,2.36,2.67,18.6,101,2.80,3.24,0.30,2.81,5.68,1.03,3.17,1185
3,1,14.37,1.95,2.50,16.8,113,3.85,3.49,0.24,2.18,7.80,0.86,3.45,1480
4,1,13.24,2.59,2.87,21.0,118,2.80,2.69,0.39,1.82,4.32,1.04,2.93,735

### 9. Delete the first, fourth, seventh, nineth, eleventh, thirteenth and fourteenth columns

In [11]:
wine.drop(columns=[1,4,7,9,11,13],inplace=True)

### 10. Assign the columns as below:

The attributes are (dontated by Riccardo Leardi, riclea '@' anchem.unige.it):  
1) alcohol  
2) malic_acid  
3) alcalinity_of_ash  
4) magnesium  
5) flavanoids  
6) proanthocyanins  
7) hue

In [12]:
wine.rename(columns={2:'Alcohol',3:'Malic_acid ',5:'Alcalinity_of_ash ',6:'Magnesium',8:'Flavanoids',10:'Proanthocyanins',12:'Hue'},inplace= True)

### 11. Set the values of the first 3 values from alcohol column as NaN

In [13]:
wine.loc[:2,'Alcohol']=np.NaN
wine.head()

,0,Alcohol,Malic_acid,Alcalinity_of_ash,Magnesium,Flavanoids,Proanthocyanins,Hue
0,1,NaN,2.43,127,2.80,0.28,5.64,3.92
1,1,NaN,2.14,100,2.65,0.26,4.38,3.40
2,1,NaN,2.67,101,2.80,0.30,5.68,3.17
3,1,1.95,2.50,113,3.85,0.24,7.80,3.45
4,1,2.59,2.87,118,2.80,0.39,4.32,2.93

### 12. Now set the value of the rows 3 and 4 of magnesium as NaN

In [14]:
wine.loc[3:4,'Magnesium']=np.NaN

### 13. Fill the value of NaN with the number 10 in alcohol and 100 in magnesium

In [15]:
wine.loc[:2,'Alcohol']=10
wine.loc[3:4,'Magnesium']=100
wine.head()

,0,Alcohol,Malic_acid,Alcalinity_of_ash,Magnesium,Flavanoids,Proanthocyanins,Hue
0,1,10.00,2.43,127,2.80,0.28,5.64,3.92
1,1,10.00,2.14,100,2.65,0.26,4.38,3.40
2,1,10.00,2.67,101,2.80,0.30,5.68,3.17
3,1,1.95,2.50,113,100.00,0.24,7.80,3.45
4,1,2.59,2.87,118,100.00,0.39,4.32,2.93

### 14. Count the number of missing values in all columns.

In [16]:
wine.isnull().sum()

0                     0
Alcohol               0
Malic_acid            0
Alcalinity_of_ash     0
Magnesium             0
Flavanoids            0
Proanthocyanins       0
Hue                   0
dtype: int64

### 15.  Create an array of 10 random numbers up until 10 and save it.

In [17]:
rand_nums=np.random.randint(range(1,11))

### 16.  Set the rows corresponding to the random numbers to NaN in the column *alcohol*

### 17.  How many missing values do we have now?

### 18. Print only the non-null values in alcohol

,0,Alcohol,Malic_acid,Alcalinity_of_ash,Magnesium,Flavanoids,Proanthocyanins,Hue
0,1,10.00,2.43,127,2.80,0.28,5.64,3.92
1,1,10.00,2.14,100,2.65,0.26,4.38,3.40
2,1,10.00,2.67,101,2.80,0.30,5.68,3.17
3,1,1.95,2.50,113,100.00,0.24,7.80,3.45
4,1,2.59,2.87,118,100.00,0.39,4.32,2.93
...,...,...,...,...,...,...,...,...
173,3,5.65,2.45,95,1.68,0.52,7.70,1.74
174,3,3.91,2.48,102,1.80,0.43,7.30,1.56
175,3,4.28,2.26,120,1.59,0.43,10.20,1.56
176,3,2.59,2.37,120,1.65,0.53,9.30,1.62
177,3,4.10,2.74,96,2.05,0.56,9.20,1.60

### 19. Delete the rows that contain missing values

In [78]:
wine.dropna(axis=0,inplace=True)

### 20.  Reset the index, so it starts with 0 again

In [20]:
wine.reset_index()
wine.drop(columns=[0],inplace= True)

## Section-3: The pupose of the below exercise (21-27) is to understand ***filtering & sorting*** data from dataframe.
## The below exercises required to use chipotle.tsv

This time we are going to pull data directly from the internet.  
Import the dataset directly from this link (https://raw.githubusercontent.com/justmarkham/DAT8/master/data/chipotle.tsv) and create dataframe called chipo

In [21]:
url="https://raw.githubusercontent.com//justmarkham//DAT8//master//data//chipotle.tsv"
chipo=pd.read_csv(url, sep='\t')
chipo.head()

,order_id,quantity,item_name,choice_description,item_price
0,1,1,Chips and Fresh Tomato Salsa,NaN,$2.39
1,1,1,Izze,[Clementine],$3.39
2,1,1,Nantucket Nectar,[Apple],$3.39
3,1,1,Chips and Tomatillo-Green Chili Salsa,NaN,$2.39
4,2,2,Chicken Bowl,"[Tomatillo-Red Chili Salsa (Hot), [Black Beans...",$16.98

### 21. How many products cost more than $10.00? 

Use `str` attribute to remove the $ sign and convert the column to proper numeric type data before filtering.

In [22]:
chipo['item_price1']=chipo.item_price.str.replace('$','')
chipo['item_price1'] = chipo['item_price1'].astype(float)

chipo[chipo['item_price1']>=10].count()

order_id              1130
quantity              1130
item_name             1130
choice_description    1123
item_price            1130
item_price1           1130
dtype: int64

### 22. Print the Chipo Dataframe & info about data frame

In [23]:
chipo.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4622 entries, 0 to 4621
Data columns (total 6 columns):
 #   Column              Non-Null Count  Dtype
---  ------              --------------  -----
 0   order_id            4622 non-null   int64
 1   quantity            4622 non-null   int64
 2   item_name           4622 non-null   object
 3   choice_description  3376 non-null   object
 4   item_price          4622 non-null   object
 5   item_price1         4622 non-null   float64
dtypes: float64(1), int64(2), object(3)
memory usage: 216.8+ KB

### 23. What is the price of each item? 
- Delete the duplicates in item_name and quantity
- Print a data frame with only two columns `item_name` and `item_price`
- Sort the values from the most to less expensive

In [24]:
chipo['item_name']=chipo['item_name'].drop_duplicates()
chipo['item_price']=chipo['item_price'].drop_duplicates()

### 24. Sort by the name of the item

In [25]:
chipo.sort_values('item_name')

,order_id,quantity,item_name,choice_description,item_price,item_price1
298,129,1,6 Pack Soft Drink,[Sprite],$6.49,6.49
39,19,1,Barbacoa Bowl,"[Roasted Chili Corn Salsa, [Fajita Vegetables,...",NaN,11.75
21,11,1,Barbacoa Burrito,"[[Fresh Tomato Salsa (Mild), Tomatillo-Green C...",$8.99,8.99
168,75,1,Barbacoa Crispy Tacos,"[Tomatillo Red Chili Salsa, [Rice, Black Beans...",NaN,11.75
1229,501,1,Barbacoa Salad Bowl,"[Fresh Tomato Salsa, [Rice, Fajita Vegetables,...",NaN,11.89
...,...,...,...,...,...,...
4617,1833,1,NaN,"[Fresh Tomato Salsa, [Rice, Black Beans, Sour ...",NaN,11.75
4618,1833,1,NaN,"[Fresh Tomato Salsa, [Rice, Sour Cream, Cheese...",NaN,11.75
4619,1834,1,NaN,"[Fresh Tomato Salsa, [Fajita Vegetables, Pinto...",NaN,11.25
4620,1834,1,NaN,"[Fresh Tomato Salsa, [Fajita Vegetables, Lettu...",NaN,8.75
4621,1834,1,NaN,"[Fresh Tomato Salsa, [Fajita Vegetables, Pinto...",NaN,8.75

### 25. What was the quantity of the most expensive item ordered?

In [80]:
df=chipo.sort_values('item_price1',ascending=False)

In [87]:
df.iloc[0,1]

15

### 26. How many times were a Veggie Salad Bowl ordered?

In [27]:
chipo[chipo['item_name']=='Veggie Salad'].count()

order_id              1
quantity              1
item_name             1
choice_description    1
item_price            0
item_price1           1
dtype: int64

### 27. How many times people orderd more than one Canned Soda?

In [28]:
chipo[(chipo['item_name']=='Canned Soda') & (chipo['quantity']>1)].count()

order_id              1
quantity              1
item_name             1
choice_description    1
item_price            1
item_price1           1
dtype: int64

## Section-4: The purpose of the below exercises is to understand how to perform aggregations of data frame
## The below exercises (28-33) required to use occupation.csv

###  28. Import the dataset occupation.csv and assign object as users

In [29]:
import os
os.chdir('C:\\Users\\gauta\\OneDrive\\Desktop\\Basic Data Manipulation - Visualization Exercise (5)\\2. Basic Data Manipulation - Visualization Exercise\\Exercise Data Files')
occupation_df=pd.read_csv('occupation.csv')
occupation_df.head()

   user_id  age gender  occupation zip_code
0        1   24      M  technician    85711
1        2   53      F       other    94043
2        3   23      M      writer    32067
3        4   24      M  technician    43537
4        5   33      F       other    15213

### 29. Discover what is the mean age per occupation

In [30]:
occupation_df[['age','occupation']].groupby(by=['occupation']).mean().head()

                     age
occupation
administrator  38.746835
artist         31.392857
doctor         43.571429
educator       42.010526
engineer       36.388060

### 30. Discover the Male ratio per occupation and sort it from the most to the least.

Use numpy.where() to encode gender column.

### 31. For each occupation, calculate the minimum and maximum ages

In [31]:
occupation_df[['occupation','age']].groupby(by=['occupation']).max().head()
occupation_df[['occupation','age']].groupby(by=['occupation']).min().head()

               age
occupation
administrator   21
artist          19
doctor          28
educator        23
engineer        22

### 32. For each combination of occupation and gender, calculate the mean age

In [32]:
occupation_df[['occupation','gender','age']].groupby(by=['occupation','gender']).mean().head()

                            age
occupation    gender
administrator F       40.638889
              M       37.162791
artist        F       30.307692
              M       32.333333
doctor        M       43.571429

### 33.  For each occupation present the percentage of women and men

In [33]:
occupation_df[['occupation','age','gender']].groupby(by=['occupation','gender']).mean()/100

                           age
occupation    gender
administrator F       0.406389
              M       0.371628
artist        F       0.303077
              M       0.323333
doctor        M       0.435714
educator      F       0.391154
              M       0.431014
engineer      F       0.295000
              M       0.366000
entertainment F       0.310000
              M       0.290000
executive     F       0.440000
              M       0.381724
healthcare    F       0.398182
              M       0.454000
homemaker     F       0.341667
              M       0.230000
lawyer        F       0.395000
              M       0.362000
librarian     F       0.400000
              M       0.400000
marketing     F       0.372000
              M       0.378750
none          F       0.365000
              M       0.186000
other         F       0.354722
              M       0.340290
programmer    F       0.321667
              M       0.332167
retired       F       0.700000
              M       0.625385
salesman      F       0.270000
              M       0.385556
scientist     F       0.283333
              M       0.363214
student       F       0.207500
              M       0.226691
technician    F       0.380000
              M       0.329615
writer        F       0.376316
              M       0.353462

## Section-6: The purpose of the below exercises is to understand how to use lambda-apply-functions
## The below exercises (34-41) required to use student-mat.csv and student-por.csv files

### 34. Import the datasets *student-mat* and *student-por* and append them and assigned object as df

In [34]:
os.chdir('C:\\Users\\gauta\\OneDrive\\Desktop\\Basic Data Manipulation - Visualization Exercise (5)\\2. Basic Data Manipulation - Visualization Exercise\\Exercise Data Files')
student_mat=pd.read_csv('student_mat.csv')
student_mat.head()

,school,sex,age,address,famsize,Pstatus,Medu,Fedu,Mjob,Fjob,...,famrel,freetime,goout,Dalc,Walc,health,absences,G1,G2,G3
0,GP,F,18,U,GT3,A,4,4,at_home,teacher,...,4,3,4,1,1,3,6,5,6,6
1,GP,F,17,U,GT3,T,1,1,at_home,other,...,5,3,3,1,1,3,4,5,5,6
2,GP,F,15,U,LE3,T,1,1,at_home,other,...,4,3,2,2,3,3,10,7,8,10
3,GP,F,15,U,GT3,T,4,2,health,services,...,3,2,2,1,1,5,2,15,14,15
4,GP,F,16,U,GT3,T,3,3,other,other,...,4,3,2,1,2,5,4,6,10,10

### 35. For the purpose of this exercise slice the dataframe from 'school' until the 'guardian' column

In [35]:
student_mat_df=student_mat.loc[:,'school':'guardian']
student_mat_df.head()

,school,sex,age,address,famsize,Pstatus,Medu,Fedu,Mjob,Fjob,reason,guardian
0,GP,F,18,U,GT3,A,4,4,at_home,teacher,course,mother
1,GP,F,17,U,GT3,T,1,1,at_home,other,course,father
2,GP,F,15,U,LE3,T,1,1,at_home,other,other,mother
3,GP,F,15,U,GT3,T,4,2,health,services,home,mother
4,GP,F,16,U,GT3,T,3,3,other,other,home,father

### 36. Create a lambda function that captalize strings (example: if we give at_home as input function and should give At_home as output.

In [36]:
student_mat_df['Mjob']=list(map(lambda x:x.capitalize(),student_mat_df['Mjob']))
student_mat_df.head()

,school,sex,age,address,famsize,Pstatus,Medu,Fedu,Mjob,Fjob,reason,guardian
0,GP,F,18,U,GT3,A,4,4,At_home,teacher,course,mother
1,GP,F,17,U,GT3,T,1,1,At_home,other,course,father
2,GP,F,15,U,LE3,T,1,1,At_home,other,other,mother
3,GP,F,15,U,GT3,T,4,2,Health,services,home,mother
4,GP,F,16,U,GT3,T,3,3,Other,other,home,father

### 37. Capitalize both Mjob and Fjob variables using above lamdba function

In [37]:
student_mat_df['Fjob']=list(map(lambda x:x.capitalize(),student_mat_df['Fjob']))

### 38. Print the last elements of the data set. (Last few records)

In [38]:
student_mat_df.tail()

,school,sex,age,address,famsize,Pstatus,Medu,Fedu,Mjob,Fjob,reason,guardian
390,MS,M,20,U,LE3,A,2,2,Services,Services,course,other
391,MS,M,17,U,LE3,T,3,1,Services,Services,course,mother
392,MS,M,21,R,GT3,T,1,1,Other,Other,course,other
393,MS,M,18,R,LE3,T,3,2,Services,Other,course,mother
394,MS,M,19,U,LE3,T,1,1,Other,At_home,course,father

### 39. Did you notice the original dataframe is still lowercase? Why is that? Fix it and captalize Mjob and Fjob.

In [39]:
student_mat_df['Fjob']=list(map(lambda x:x.capitalize(),student_mat_df['Fjob']))
student_mat_df.head()

,school,sex,age,address,famsize,Pstatus,Medu,Fedu,Mjob,Fjob,reason,guardian
0,GP,F,18,U,GT3,A,4,4,At_home,Teacher,course,mother
1,GP,F,17,U,GT3,T,1,1,At_home,Other,course,father
2,GP,F,15,U,LE3,T,1,1,At_home,Other,other,mother
3,GP,F,15,U,GT3,T,4,2,Health,Services,home,mother
4,GP,F,16,U,GT3,T,3,3,Other,Other,home,father

### 40. Create a function called majority that return a boolean value to a new column called legal_drinker

### 41. Multiply every number of the dataset by 10.

In [40]:
count_num=student_mat_df.select_dtypes('number')
count_num=count_num*10

## Section-6: The purpose of the below exercises is to understand how to perform simple joins
## The below exercises (42-48) required to use cars1.csv and cars2.csv files

### 42. Import the datasets cars1.csv and cars2.csv and assign names as cars1 and cars2

In [41]:
os.chdir('C:\\Users\\gauta\\OneDrive\\Desktop\\Basic Data Manipulation - Visualization Exercise (5)\\2. Basic Data Manipulation - Visualization Exercise\\Exercise Data Files')
student_mat=pd.read_csv('student_mat.csv')

   ### 43. Print the information to cars1 by applying below functions 
   hint: Use different functions/methods like type(), head(), tail(), columns(), info(), dtypes(), index(), shape(), count(), size(), ndim(), axes(), describe(), memory_usage(), sort_values(), value_counts()
   Also create profile report using pandas_profiling.Profile_Report

In [42]:
os.chdir('C:\\Users\\gauta\\OneDrive\\Desktop\\Basic Data Manipulation - Visualization Exercise (5)\\2. Basic Data Manipulation - Visualization Exercise\\Exercise Data Files')
cars1_df=pd.read_csv('cars1.csv')
cars1_df.head()

,mpg,cylinders,displacement,horsepower,weight,acceleration,model,origin,car,Unnamed: 9,Unnamed: 10,Unnamed: 11,Unnamed: 12,Unnamed: 13
0,18.0,8,307,130,3504,12.0,70,1,chevrolet chevelle malibu,NaN,NaN,NaN,NaN,NaN
1,15.0,8,350,165,3693,11.5,70,1,buick skylark 320,NaN,NaN,NaN,NaN,NaN
2,18.0,8,318,150,3436,11.0,70,1,plymouth satellite,NaN,NaN,NaN,NaN,NaN
3,16.0,8,304,150,3433,12.0,70,1,amc rebel sst,NaN,NaN,NaN,NaN,NaN
4,17.0,8,302,140,3449,10.5,70,1,ford torino,NaN,NaN,NaN,NaN,NaN

### 44. It seems our first dataset has some unnamed blank columns, fix cars1

In [43]:
os.chdir('C:\\Users\\gauta\\OneDrive\\Desktop\\Basic Data Manipulation - Visualization Exercise (5)\\2. Basic Data Manipulation - Visualization Exercise\\Exercise Data Files')
cars2_df=pd.read_csv('cars2.csv')
cars2_df.head()

,mpg,cylinders,displacement,horsepower,weight,acceleration,model,origin,car
0,33.0,4,91,53,1795,17.4,76,3,honda civic
1,20.0,6,225,100,3651,17.7,76,1,dodge aspen se
2,18.0,6,250,78,3574,21.0,76,1,ford granada ghia
3,18.5,6,250,110,3645,16.2,76,1,pontiac ventura sj
4,17.5,6,258,95,3193,17.8,76,1,amc pacer d/l

### 45. What is the number of observations in each dataset?

In [44]:
cars1_df.head()

,mpg,cylinders,displacement,horsepower,weight,acceleration,model,origin,car,Unnamed: 9,Unnamed: 10,Unnamed: 11,Unnamed: 12,Unnamed: 13
0,18.0,8,307,130,3504,12.0,70,1,chevrolet chevelle malibu,NaN,NaN,NaN,NaN,NaN
1,15.0,8,350,165,3693,11.5,70,1,buick skylark 320,NaN,NaN,NaN,NaN,NaN
2,18.0,8,318,150,3436,11.0,70,1,plymouth satellite,NaN,NaN,NaN,NaN,NaN
3,16.0,8,304,150,3433,12.0,70,1,amc rebel sst,NaN,NaN,NaN,NaN,NaN
4,17.0,8,302,140,3449,10.5,70,1,ford torino,NaN,NaN,NaN,NaN,NaN

### 46. Join cars1 and cars2 into a single DataFrame called cars

In [2]:
cars=pd.merge(left=cars1_df,right=cars2_df,how='outer',left_on='mpg',right_on='mpg')

NameError: name 'pd' is not defined

### 47. There is a column missing, called owners. Create a random number Series from 15,000 to 73,000.

In [46]:
cars2_df['owners']=pd.DataFrame(range(15000,73000))

In [47]:
### 48. Add the column owners to cars

In [48]:
cars2_df['owners']=pd.DataFrame(range(15000,73000,2))
cars2_df.head(200)

,mpg,cylinders,displacement,horsepower,weight,acceleration,model,origin,car,owners
0,33.0,4,91,53,1795,17.4,76,3,honda civic,15000
1,20.0,6,225,100,3651,17.7,76,1,dodge aspen se,15002
2,18.0,6,250,78,3574,21.0,76,1,ford granada ghia,15004
3,18.5,6,250,110,3645,16.2,76,1,pontiac ventura sj,15006
4,17.5,6,258,95,3193,17.8,76,1,amc pacer d/l,15008
...,...,...,...,...,...,...,...,...,...,...
195,27.0,4,140,86,2790,15.6,82,1,ford mustang gl,15390
196,44.0,4,97,52,2130,24.6,82,2,vw pickup,15392
197,32.0,4,135,84,2295,11.6,82,1,dodge rampage,15394
198,28.0,4,120,79,2625,18.6,82,1,ford ranger,15396
199,31.0,4,119,82,2720,19.4,82,1,chevy s-10,15398

## Section-7: The purpose of the below exercises is to understand how to perform date time operations

### 49. Write a Python script to display the
- a. Current date and time
- b. Current year
- c. Month of year
- d. Week number of the year
- e. Weekday of the week
- f. Day of year
- g. Day of the month
- h. Day of week

In [49]:
pd.Timestamp.today()

Timestamp('2024-09-01 08:56:27.064544')

In [50]:
pd.Timestamp.today().year

2024

In [51]:
pd.Timestamp.today().month

9

In [52]:
pd.Timestamp.today().month

9

In [53]:
pd.Timestamp.today()

Timestamp('2024-09-01 08:56:27.113244')

### 50. Write a Python program to convert a string to datetime.
Sample String : Jul 1 2014 2:43PM 

Expected Output : 2014-07-01 14:43:00

In [54]:
date_1='Jul 1 2014 2:43 PM'

date_2=pd.to_datetime(date_1)

In [55]:
date_2

Timestamp('2014-07-01 14:43:00')

### 51. Write a Python program to subtract five days from current date.

Current Date : 2015-06-22

5 days before Current Date : 2015-06-17

In [68]:
df='2024-08-25'

In [70]:
pd.to_datetime('df',format='%Y-%m-%d')

ValueError: time data "df" doesn't match format "%Y-%m-%d", at position 0. You might want to try:
    - passing `format` if your strings have a consistent format;
    - passing `format='ISO8601'` if your strings are all ISO8601 but not necessarily in exactly the same format;
    - passing `format='mixed'`, and the format will be inferred for each element individually. You might want to use `dayfirst` alongside this.

### 52. Write a Python program to convert unix timestamp string to readable date.

Sample Unix timestamp string : 1284105682
    
Expected Output : 2010-09-10 13:31:22

### 53. Convert the below Series to pandas datetime : 

DoB = pd.Series(["07Sep59","01Jan55","15Dec47","11Jul42"])

Make sure that the year is 19XX not 20XX

In [ ]:
DoB = pd.Series(["07Sep1959","01Jan1955","15Dec1947","11Jul1942"])
DOB_1=DoB[:]
DOB_2=pd.to_datetime(DOB_1)

In [ ]:
DOB_2

### 54. Write a Python program to get days between two dates.

In [ ]:
d2=pd.to_datetime('2024-8-20')
df1.day-d2.day

### 55. Convert the below date to datetime and then change its display format using the .dt module

Date = "15Dec1989"

Result : "Friday, 15 Dec 98"

In [71]:
df1= pd.to_datetime('15Dec1989')

In [72]:
df1.strftime('%A %d %b %y')

'Friday 15 Dec 89'

## The below exercises (56-66) required to use wind.data file

### About wind.data:

The data have been modified to contain some missing values, identified by NaN.  

1. The data in 'wind.data' has the following format:

"""
Yr Mo Dy   RPT   VAL   ROS   KIL   SHA   BIR   DUB   CLA   MUL   CLO   BEL   MAL
61  1  1 15.04 14.96 13.17  9.29   NaN  9.87 13.67 10.25 10.83 12.58 18.50 15.04
61  1  2 14.71   NaN 10.83  6.50 12.62  7.67 11.50 10.04  9.79  9.67 17.54 13.83
61  1  3 18.50 16.88 12.33 10.13 11.17  6.17 11.25   NaN  8.50  7.67 12.75 12.71
"""
The first three columns are year, month and day.  The remaining 12 columns are average windspeeds in knots at 12 locations in Ireland on that day.

### 56. Import the dataset wind.data and assign it to a variable called data and replace the first 3 columns by a proper date time index

In [ ]:

os.chdir('C:\\Users\\gauta\\OneDrive\\Desktop\\Basic Data Manipulation - Visualization Exercise (5)\\2. Basic Data Manipulation - Visualization Exercise\\Exercise Data Files')
data=pd.read_csv('wind.data')
data.head(20)

### 57. Year 2061 is seemingly imporoper. Convert every year which are < 70 to 19XX instead of 20XX.

### 58. Set the right dates as the index. Pay attention at the data type, it should be datetime64[ns].

In [ ]:
date_1=data['Yr'].astype('str')+data['Mo'].astype('str')+data['Dy'].astype('str')

### 59. Compute how many values are missing for each location over the entire record.  
#### They should be ignored in all calculations below.

In [ ]:
data.isnull().sum()

### 60. Compute how many non-missing values there are in total.

In [ ]:
data.notnull().sum()

### 61. Calculate the mean windspeeds over all the locations and all the times.
#### A single number for the entire dataset.

In [ ]:
data[['Yr','RPT','VAL']].groupby(by=['Yr']).min()

### 62. Create a DataFrame called loc_stats and calculate the min, max and mean windspeeds and standard deviations of the windspeeds at each location over all the days 

#### A different set of numbers for each location.

### 63. Create a DataFrame called day_stats and calculate the min, max and mean windspeed and standard deviations of the windspeeds across all the locations at each day.

#### A different set of numbers for each day.

### 64. Find the average windspeed in January for each location.  
#### Treat January 1961 and January 1962 both as January.

### 65. Calculate the mean windspeed for each month in the dataset.  
#### Treat January 1961 and January 1962 as *different* months.
#### (hint: first find a  way to create an identifier unique for each month.)

### 66. Calculate the min, max and mean windspeeds and standard deviations of the windspeeds across all locations for each week (assume that the first week starts on January 2 1961) for the first 52 weeks.

## The below exercises (67-70) required to use appl_1980_2014.csv  file

In [ ]:
os.chdir('C:\\Users\\gauta\\OneDrive\\Desktop\\Basic Data Manipulation - Visualization Exercise (5)\\2. Basic Data Manipulation - Visualization Exercise\\Exercise Data Files')

### 67. Import the file appl_1980_2014.csv and assign it to a variable called 'apple'

In [ ]:
apple=pd.read_csv('appl_1980_2014.csv')
apple.head()

### 68.  Check out the type of the columns

In [ ]:
apple.dtypes

### 69. Transform the Date column as a datetime type

In [ ]:
apple['Date']=pd.to_datetime(apple.Date,format='%Y-%m-%d')
apple['Date'].head()

### 70.  Set the date as the index

In [ ]:
apple['Date'].reset_index()

### 71.  Is there any duplicate dates?

In [ ]:
apple.duplicated().sum()

### 72.  The index is from the most recent date. Sort the data so that the first entry is the oldest date.

In [ ]:
apple.sort_values('Date',ascending=False)

### 73. Get the last business day of each month

In [ ]:
df4= pd.PeriodIndex(apple['Date'], freq="M")
apple['Lastday']=df4.end_time.day

In [ ]:
apple['Lastday']

### 74.  What is the difference in days between the first day and the oldest

In [ ]:
apple['Lastday'].max()-apple['Lastday'].min()

### 75.  How many months in the data we have?

## Section-8: The purpose of the below exercises is to understand how to create basic graphs

### 76. Plot the 'Adj Close' value. Set the size of the figure to 13.5 x 9 inches

In [ ]:
apple.rename(columns={"Adj Close":"Adj_close"},inplace=True)

In [ ]:


plt.figure(figsize=(13.5,9))
apple.Adj_close.plot(kind='hist')

## The below exercises (77-80) required to use Online_Retail.csv file

### 77. Import the dataset from this Online_Retail.csv and assign it to a variable called online_rt

In [ ]:

import os
os.chdir('C:\\Users\\gauta\\OneDrive\\Desktop\\Basic Data Manipulation - Visualization Exercise (5)\\2. Basic Data Manipulation - Visualization Exercise\\Exercise Data Files')
online_rt=pd.read_csv('Online_Retail.csv',encoding= 'unicode_escape')

### 78. Create a barchart with the 10 countries that have the most 'Quantity' ordered except UK

In [ ]:
top10_quan=pd.pivot_table(online_rt,index=['Country'],values=['Quantity'],aggfunc='sum').sort_values('Quantity',ascending=False).iloc[1:11]

In [1]:
plt.figure(figsize=(10,10))
top10_quan.plot(kind='bar')
plt.show()

NameError: name 'plt' is not defined

### 79.  Exclude negative Quatity entries

In [ ]:
maindata_Df=online_rt[online_rt['Quantity']>1]

### 80. Create a scatterplot with the Quantity per UnitPrice by CustomerID for the top 3 Countries
Hint: First we need to find top-3 countries based on revenue, then create scater plot between Quantity and Unitprice for each country separately

In [ ]:
maindata_Df

In [ ]:
pd.pivot_table(maindata_Df,index=['Country'],values=['UnitPrice'])

## The below exercises (81-90) required to use FMCG_Company_Data_2019.csv file

### 81. Import the dataset FMCG_Company_Data_2019.csv and assign it to a variable called company_data

In [75]:
os.chdir('C:\\Users\\gauta\\OneDrive\\Desktop\\Basic Data Manipulation - Visualization Exercise (5)\\2. Basic Data Manipulation - Visualization Exercise\\Exercise Data Files')
company_data=pd.read_csv('FMCG_Company_Data_2019.csv')
company_data.head()

,Month,FaceCream,FaceWash,ToothPaste,Soap,Shampo,Moisturizer,Total_Units,Total_Revenue,Total_Profit
0,Jan-19,2500,1500,5200,9200,1200,1500,21100,3584890,211000
1,Feb-19,2630,1200,5100,6100,2100,1200,18330,2864979,183300
2,Mar-19,2140,1340,4550,9550,3550,1340,22470,4058082,224700
3,Apr-19,3400,1130,5870,8870,1870,1130,22270,2890646,222700
4,May-19,3600,1740,4560,7760,1560,1740,20960,2997280,209600

In [77]:
### 82. Create line chart for Total Revenue of all months with following properties
- X label name = Month
- Y label name = Total Revenue

SyntaxError: invalid syntax (2881408797.py, line 2)

plt.figure(figsize=(15,15))
company_data.plot(kind='line',x='Month',y='Total_Revenue')
plt.ylabel('Revenue')
plt.show()

### 83. Create line chart for Total Units of all months with following properties
- X label name = Month
- Y label name = Total Units
- Line Style dotted and Line-color should be red
- Show legend at the lower right location.

In [ ]:
plt.figure(figsize=(10,20))
company_data.plot(kind='line',x='Month',y='Total_Units')
plt.ylabel('Units')
plt.show()

### 84. Read all product sales data (Facecream, FaceWash, Toothpaste, Soap, Shampo, Moisturizer) and show it  using a multiline plot
- Display the number of units sold per month for each product using multiline plots. (i.e., Separate Plotline for each product ).

In [ ]:
products=company_data.iloc[1:-3]
products

In [73]:
for i in products.columns:
    plt.figure(figsize=(10,20))

NameError: name 'products' is not defined

In [ ]:
products.dtypes

### 85. Create Bar Chart for soap of all months and Save the chart in folder

In [74]:
plt.figure(figsize=(10,10))
products.plot(kind='bar',x='Month',y='Soap')
plt.legend(bbox_to_anchor=(1,1), loc='upper left')

NameError: name 'products' is not defined

### 86. Create Stacked Bar Chart for Soap, Shampo, ToothPaste for each month
The bar chart should display the number of units sold per month for each product. Add a separate bar for each product in the same chart.

In [ ]:
Stack_df=products[['Month','ToothPaste','Soap','Shampo','Total_Units']]

### 87. Create Histogram for Total Revenue

In [ ]:
plt.figure(figsize=(5,5))
plt.hist(products.Total_Revenue) 
plt.show()

### 88. Calculate total sales data (quantity) for 2019 for each product and show it using a Pie chart. Understand percentage contribution from each product

### 89. Create line plots for Soap & Facewash of all months in a single plot using Subplot

### 90. Create Box Plot for Total Profit variable

In [58]:
plt.figure(figsize=(5,7))
products.Total_Profit.plot(kind='box')

NameError: name 'products' is not defined